from pyrogram import Client, filters
import random
import json
from colorama import init, Fore
init()

print(Fore.YELLOW + """
╔══╗╔══╗╔══╗╔╗──╔╗╔═══╗╔═══╗
║╔═╝║╔╗║║╔╗║║║──║║║╔══╝║╔═╗║
║║──║║║║║╚╝║║╚╗╔╝║║╚══╗║╚═╝║
║║──║║║║║╔╗║║╔╗╔╗║║╔══╝║╔══╝
║╚═╗║║║║║║║║║║╚╝║║║╚══╗║║
╚══╝╚╝╚╝╚╝╚╝╚╝──╚╝╚═══╝╚╝
╔════╗╔══╗
╚═╗╔═╝║╔═╝
──║║──║║
──║║──║║
──║║──║║
──╚╝──╚╝
╔══╗╔════╗──╔═══╗╔╗╔╗╔═══╗╔╗╔╗╔══╗╔╗╩╔╗
║╔╗║╚═╗╔═╝──╚══╗║║║║║║╔══╝║║║║║╔╗║║║─║║
║║║║──║║─────╔═╝║║╚╝║║╚══╗║╚╝║║║║║║║─║║
║║║║──║║─────╚═╗║╚═╗║║╔═╗║║╔╗║║║║║║║─╔║
║╚╝║──║║────╔══╝║─╔╝║║╚═╝║║║║║║╚╝║║╚═╝║
╚══╝──╚╝────╚═══╝─╚═╝╚═══╝╚╝╚╝╚══╝╚═══╝
╔══╗╔╗╔╗╔═══╗╔════╗╔╗╔══╗╔╗╔╗
║╔═╝║║║║║╔══╝╚═╗╔═╝║║║╔═╝║║║║
║║──║╚╝║║╚══╗──║║──║╚╝║──║║║║
║║──╚═╗║║╔══╝──║║──║╔╗║──║║╔║
║╚═╗──║║║╚══╗──║║──║║║╚═╗║╚╝║
╚══╝──╚╝╚═══╝──╚╝──╚╝╚══╝╚══╝
	""")

print("Вам нужно получить api_id, api_hash. Перейдите на страницу my.telegram.org и авторизируйтесь, дальше кликните на API development tools")

app = Client(
	"my_account",
	api_id = "", #вставьте сюда api_id
	api_hash = "" #сюда api_hash
	)

@app.on_message(filters.me & filters.command("spam", "."))
async def lol_cmd(app, msg):
	for i in range(350): #тут можно настороить кол-во сообщений
		text = msg.text.split(maxsplit=1)[1]
		await msg.reply(text)

app.run()
